{
  "names": [
    "Wesly Nyabunga",
    "Roy Makanjira",
    "Kudzaishe Chikowore",
    "Tanaka Hama",
    "Tinotenda Hove",
    "Peviorgents Pimbirimano",
    "Weston Sululu",
    "Nigel Panashe Mashari",
    "Tawanda Muchenu",
    "Allan Svotwa",
    "Macdonald Chirumezani",
    "Decent Gwavava",
    "Nokutenda Nyamhute",
    "Evidence T Murima",
    "Dylan Kanyimo",
    "Takunda Dzowa",
    "Ellarton Kagona",
    "Ernest Tafadzwa Maenda",
    "Elsie Chakurungama",
    "Benedicta Phiri",
    "Precious Mutema",
    "Mitchel Bonde",
    "Mitchel Mukwaruwa",
    "Lyncia Chiguri",
    "Sharon Khupe",
    "Tinotenda Kutama",
    "Delight Mamu",
    "Blessing Kusiwani",
    "Samantha Tumbare",
    "Kelly Mwashita",
    "Anna Chidawanyika",
    "Tadiwa Mangate",
    "Memory Makara",
    "Elsie Bvenura",
    "Mejury Zvarevashe",
    "Ruth Chavhunduka",
    "Faith Mugoni",
    "Felistas Gomba"
  ],
  "questions": [
    "What is Python, and what are its key features?",
    "What are variables in Python, and how do you declare them?",
    "What are the different data types in Python?",
    "How do you convert one data type to another in Python?",
    "What is the difference between mutable and immutable data types in Python?",
    "How do you check the data type of a variable in Python?",
    "What is type casting in Python? Provide an example.",
    "What are Python's built-in data types?",
    "What is the difference between None, True, and False in Python?",
    "How do you assign multiple values to multiple variables in Python?",
    "What are f-strings in Python, and how are they used?",
    "What is the difference between ‘is’ and ‘==’ operators in Python?",
    "How do you take user input in Python, and what data type does it return?",
    "What is the difference between global and local variables in Python?",
    "How do you declare a constant in Python?",
    "What are escape characters in Python, and how do you use them?",
    "What is string formatting in Python? Give examples.",
    "How do you perform arithmetic operations in Python?",
    "What is the purpose of the 'id()' function in Python?",
    "How do you swap the values of two variables in Python without using a temporary variable?",
    "What are the different ways to format strings in Python?",
    "What happens if you try to modify a string in Python?",
    "How do you create a variable with a dynamic data type in Python?",
    "Write a Python program to check if a number is even or odd.",
    "Write a Python program to swap two numbers without using a third variable.",
    "Write a Python program to find the maximum of three numbers.",
    "Write a Python program to check if a number is positive, negative, or zero.",
    "Write a Python program to calculate the factorial of a number.",
    "Write a Python program to reverse a string.",
    "Write a Python program to count the number of vowels in a string.",
    "Write a Python program to check if a given year is a leap year."
  ]
}
