{
  "names": ["Roy", "Elsie_One", "Precious", "Elsie_Two", "Elaton", "Blessing", "Daniel"],
  "questions": [
    "Tell me about a time you faced a difficult problem. How did you solve it?",
    "Describe a situation where you had to work in a team to achieve a goal.",
    "Can you share an example of a project where you had to meet a tight deadline?",
    "Tell me about a time you failed at something. What did you learn from it?",
    "Describe a time you had to learn a new skill quickly. How did you approach it?",
    "Can you give an example of a situation where you had to handle a conflict?",
    "Tell me about a time when you had to adapt to a major change.",
    "Describe a situation where you took initiative without being asked.",
    "Have you ever had to explain something complex to someone with no prior knowledge? How did you do it?",
    "Tell me about a time you had to manage multiple tasks at once. How did you prioritize?",
    "Describe a time when you had to persuade someone to see things your way.",
    "Tell me about a time you made a mistake at work or school. How did you handle it?",
    "Can you give an example of a time when you exceeded expectations on a task?",
    "Describe a moment when you received constructive criticism. How did you react?",
    "Tell me about a time when you had to deal with an uncooperative teammate.",
    "Have you ever had to take responsibility for a project’s failure? What did you do next?",
    "Describe a situation where you had to work under pressure.",
    "Tell me about a time when you had to give a presentation or speak in front of a group.",
    "Can you share an experience where you had to step up as a leader unexpectedly?",
    "Describe a time when you had to adjust to a company’s new technology or process.",
    "Tell me about a time you had to help someone else succeed.",
    "Have you ever had to resolve a disagreement between two people? How did you do it?",
    "Describe a moment when you had to make a quick decision with limited information.",
    "Tell me about a time when you had to handle a demanding customer or client.",
    "Have you ever had to learn from a failure and try again? What did you change?",
    "Describe a time when you set a challenging goal and how you achieved it.",
    "Tell me about a situation where you had to work with someone you didn't get along with.",
    "Can you give an example of a time when you helped improve a process or system?",
    "Tell me about a time when you had to manage an important responsibility outside of school or work.",
    "Describe a time when you had to work on a project outside of your comfort zone."
  ]
}
